Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-10-1-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      1
Time taken for tests:   1.430 seconds
Complete requests:      10
Failed requests:        0
Total transferred:      1590 bytes
HTML transferred:       220 bytes
Requests per second:    7.00 [#/sec] (mean)
Time per request:       142.953 [ms] (mean)
Time per request:       142.953 [ms] (mean, across all concurrent requests)
Transfer rate:          1.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:    31  143 307.3     44    1016
Waiting:       31  142 307.5     43    1016
Total:         31  143 307.3     44    1016

Percentage of the requests served within a certain time (ms)
  50%     44
  66%     55
  75%     62
  80%     77
  90%   1016
  95%   1016
  98%   1016
  99%   1016
 100%   1016 (longest request)