Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-10-10-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      10
Time taken for tests:   8.727 seconds
Complete requests:      10
Failed requests:        0
Total transferred:      1590 bytes
HTML transferred:       220 bytes
Requests per second:    1.15 [#/sec] (mean)
Time per request:       8726.723 [ms] (mean)
Time per request:       872.672 [ms] (mean, across all concurrent requests)
Transfer rate:          0.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  638 548.1   1062    1064
Processing:  1778 3904 1214.3   3827    5956
Waiting:     1706 3840 1231.7   3799    5906
Total:       1779 4542 1581.0   4567    7019

Percentage of the requests served within a certain time (ms)
  50%   4567
  66%   4889
  75%   5441
  80%   6506
  90%   7019
  95%   7019
  98%   7019
  99%   7019
 100%   7019 (longest request)