Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-10-5-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      5
Time taken for tests:   6.317 seconds
Complete requests:      10
Failed requests:        0
Total transferred:      1590 bytes
HTML transferred:       220 bytes
Requests per second:    1.58 [#/sec] (mean)
Time per request:       3158.364 [ms] (mean)
Time per request:       631.673 [ms] (mean, across all concurrent requests)
Transfer rate:          0.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  234 493.7      0    1171
Processing:  1306 1904 396.6   2129    2396
Waiting:     1302 1865 388.5   2083    2391
Total:       1306 2138 666.4   2158    3386

Percentage of the requests served within a certain time (ms)
  50%   2158
  66%   2277
  75%   2396
  80%   2929
  90%   3386
  95%   3386
  98%   3386
  99%   3386
 100%   3386 (longest request)