Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-100-1-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      1
Time taken for tests:   27.615 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      15900 bytes
HTML transferred:       2200 bytes
Requests per second:    3.62 [#/sec] (mean)
Time per request:       276.154 [ms] (mean)
Time per request:       276.154 [ms] (mean, across all concurrent requests)
Transfer rate:          0.56 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   124  276  98.1    260     748
Waiting:      124  270  96.8    255     748
Total:        124  276  98.1    260     748

Percentage of the requests served within a certain time (ms)
  50%    260
  66%    298
  75%    317
  80%    332
  90%    369
  95%    435
  98%    660
  99%    748
 100%    748 (longest request)