Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-100-10-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      10
Time taken for tests:   53.682 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      15900 bytes
HTML transferred:       2200 bytes
Requests per second:    1.86 [#/sec] (mean)
Time per request:       5368.205 [ms] (mean)
Time per request:       536.820 [ms] (mean, across all concurrent requests)
Transfer rate:          0.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  960 2503.1      0   15461
Processing:  1767 3824 1225.0   3616   10308
Waiting:     1744 3763 1215.5   3520   10260
Total:       1827 4784 2874.0   4107   20074

Percentage of the requests served within a certain time (ms)
  50%   4107
  66%   4868
  75%   5351
  80%   5639
  90%   7284
  95%  11351
  98%  19049
  99%  20074
 100%  20074 (longest request)