Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-100-5-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      5
Time taken for tests:   39.235 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      15900 bytes
HTML transferred:       2200 bytes
Requests per second:    2.55 [#/sec] (mean)
Time per request:       1961.764 [ms] (mean)
Time per request:       392.353 [ms] (mean, across all concurrent requests)
Transfer rate:          0.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   31 177.9      0    1040
Processing:   742 1808 589.1   1710    3543
Waiting:      721 1762 580.1   1683    3495
Total:        742 1839 645.0   1714    4582

Percentage of the requests served within a certain time (ms)
  50%   1714
  66%   1920
  75%   2183
  80%   2336
  90%   2713
  95%   3189
  98%   3462
  99%   4582
 100%   4582 (longest request)