Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-50-1-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      1
Time taken for tests:   6.106 seconds
Complete requests:      50
Failed requests:        0
Total transferred:      7950 bytes
HTML transferred:       1100 bytes
Requests per second:    8.19 [#/sec] (mean)
Time per request:       122.121 [ms] (mean)
Time per request:       122.121 [ms] (mean, across all concurrent requests)
Transfer rate:          1.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.7      0      19
Processing:    50  122  52.9    118     351
Waiting:       49  120  52.7    113     350
Total:         50  122  52.7    118     351

Percentage of the requests served within a certain time (ms)
  50%    118
  66%    129
  75%    142
  80%    156
  90%    186
  95%    204
  98%    351
  99%    351
 100%    351 (longest request)