Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-50-10-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      10
Time taken for tests:   25.763 seconds
Complete requests:      50
Failed requests:        0
Total transferred:      7950 bytes
HTML transferred:       1100 bytes
Requests per second:    1.94 [#/sec] (mean)
Time per request:       5152.514 [ms] (mean)
Time per request:       515.251 [ms] (mean, across all concurrent requests)
Transfer rate:          0.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  687 1185.3      1    7164
Processing:  1380 3504 1098.4   3437    6857
Waiting:     1369 3431 1092.2   3268    6801
Total:       1380 4191 1517.0   3955   10739

Percentage of the requests served within a certain time (ms)
  50%   3955
  66%   4516
  75%   4969
  80%   5157
  90%   6149
  95%   6461
  98%  10739
  99%  10739
 100%  10739 (longest request)