Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-50-5-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      5
Time taken for tests:   19.805 seconds
Complete requests:      50
Failed requests:        0
Total transferred:      7950 bytes
HTML transferred:       1100 bytes
Requests per second:    2.52 [#/sec] (mean)
Time per request:       1980.504 [ms] (mean)
Time per request:       396.101 [ms] (mean, across all concurrent requests)
Transfer rate:          0.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   62 247.0      0    1056
Processing:   935 1680 446.2   1643    2951
Waiting:      790 1639 439.5   1625    2915
Total:        935 1742 503.2   1688    2952

Percentage of the requests served within a certain time (ms)
  50%   1688
  66%   1974
  75%   2034
  80%   2128
  90%   2438
  95%   2727
  98%   2952
  99%   2952
 100%   2952 (longest request)